package com.helinfeng.web.controller;

import org.springframework.stereotype.Controller;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.ResponseBody;

import java.util.HashMap;
import java.util.Map;

@Controller
public class MusicController {


    @RequestMapping("/music/list")
    @ResponseBody
    public Map<String,Object> musicList(){
        Map<String,Object> map = new HashMap<>();

        /*{
            "name":"告白气球",
                "singer": "周杰伦",
                "album": "周杰伦的床边故事",
                "time": "03:35",
                "link_url":"./source/告白气球.mp3",
                "cover":"./source/告白气球.jpg",
                "link_lrc":"./source/告白气球.txt"
        },
        */

        map.put("name","告白气球");
        map.put( "singer","周杰伦");
        map.put( "time","03:35");
        map.put("link_url","告白气球.mp3");
        map.put("cover","https://blogimage-1301122333.cos.ap-nanjing.myqcloud.com/images/a22e1d2147694c58934880c7712bb552.jpg");
        map.put("link_lrc","[ti:百里守约 (《王者荣耀》百里守约英雄主打歌)]\n" +
                "[ar:萧敬腾]\n" +
                "[al:百里守约]\n" +
                "[by:]\n" +
                "[offset:0]\n" +
                "[00:00.01]百里守约 (《王者荣耀》百里守约英雄主打歌) - 萧敬腾\n" +
                "[00:00.02]词：邹强 Chiang Tsou (狮子合唱团)\n" +
                "[00:00.03]曲：萧敬腾 Jam Hsiao\n" +
                "[00:00.04]编曲：邹强 Chiang Tsou (狮子合唱团)\n" +
                "[00:00.05]钢琴：萧敬腾 Jam Hsiao\n" +
                "[00:00.06]鼓：胡浈筌(阿牛)Bull\n" +
                "[00:00.07]录音师：刘品贤 Jimmy Liu\n" +
                "[00:00.08]录音室：Jam Studio\n" +
                "[00:00.09]混音师：赖世凯 NiceGuy\n" +
                "[00:00.10]\n" +
                "[00:01.31]每一次 抬头仰望\n" +
                "[00:03.76]只看见想念的你\n" +
                "[00:06.48]\n" +
                "[00:07.17]每一刻 无力迷惘\n" +
                "[00:09.89]依旧信守着约定\n" +
                "[00:12.46]\n" +
                "[00:13.37]狙击镜充斥敌人踪影\n" +
                "[00:15.56]\n" +
                "[00:16.29]冷静安排击破的顺序\n" +
                "[00:18.63]\n" +
                "[00:19.38]扣扳机一一送出安息\n" +
                "[00:21.99]守约的日子里\n" +
                "[00:24.52]\n" +
                "[00:37.38]长城上 抬头仰望\n" +
                "[00:39.89]与天上的父约定\n" +
                "[00:42.39]\n" +
                "[00:43.44]这一刻 不再迷惘\n" +
                "[00:45.92]依旧热血着初心\n" +
                "[00:48.66]\n" +
                "[00:49.36]狙击镜充斥敌人踪影\n" +
                "[00:52.34]冷静安排击破的顺序\n" +
                "[00:54.84]\n" +
                "[00:55.42]扣扳机一一送出安息\n" +
                "[00:58.13]守约的日子里\n" +
                "[01:01.04]甩出狂风之息 穿越人群\n" +
                "[01:04.94]讨伐成魔的大地\n" +
                "[01:07.26]狙击的掌心\n" +
                "[01:10.59]夺还属于世界的寂静\n" +
                "[01:13.28]信守我的约定 我的血液\n" +
                "[01:17.12]钢铁般坚毅的心\n" +
                "[01:19.43]划过那希望的天际\n" +
                "[01:25.67]\n" +
                "[01:31.89]长城上 抬头仰望\n" +
                "[01:34.56]与天上的父约定\n" +
                "[01:37.04]\n" +
                "[01:37.91]这一刻 不再迷惘\n" +
                "[01:40.62]依旧热血着初心\n" +
                "[01:44.06]狙击镜充斥敌人踪影\n" +
                "[01:47.09]冷静安排击破的顺序\n" +
                "[01:50.10]扣扳机一一送出安息\n" +
                "[01:52.82]守约的日子里\n" +
                "[01:55.77]\n" +
                "[01:56.63]我相信\n" +
                "[01:58.08]甩出狂风之息 穿越人群\n" +
                "[02:02.67]讨伐成魔的大地\n" +
                "[02:04.96]狙击的掌心\n" +
                "[02:08.31]夺还属于世界的寂静\n" +
                "[02:11.03]信守我的约定 我的血液\n" +
                "[02:14.84]钢铁般坚毅的心\n" +
                "[02:17.14]划过那希望的天际\n" +
                "[02:23.47]\n" +
                "[02:35.38]化身狂风之息 飞越人群\n" +
                "[02:39.18]找寻失落的美丽\n" +
                "[02:41.56]炙热的掌心\n" +
                "[02:43.91]\n" +
                "[02:44.81]祈祷属于世界的静谧\n" +
                "[02:47.54]信守我的约定 我的血液\n" +
                "[02:51.29]钢铁般坚毅的心\n" +
                "[02:53.52]划过那希望的天际\n" +
                "[02:59.69]甩开狂风之息 穿越人群\n" +
                "[03:03.47]讨伐成魔的大地\n" +
                "[03:05.76]狙击的掌心\n" +
                "[03:09.06]夺还属于世界的寂静\n" +
                "[03:11.81]信守我的约定 我的血液\n" +
                "[03:15.59]钢铁般坚毅的心\n" +
                "[03:17.89]划过那希望的天际");
        return map;
    }
    @RequestMapping("music")
    public String music(){
        return "music";
    }
}


